Nat-thapas/STM32-ILI9341/Src/ili9341.c
    if (bufferIndex > 0) ILI9341_WriteData(ili9341, (uint8_t*)buffer, bufferIndex * 2);
}

void ILI9341_WriteStringScaled(
    ILI9341_HandleTypeDef* ili9341,
    int16_t x,
    int16_t y,
    const char* str,
    ILI9341_FontDef font,
    uint16_t color,
    uint16_t bgColor,
    uint16_t scale,
    int16_t tracking
) {
    if (y >= ili9341->height) return;

    ILI9341_Select(ili9341);

    while (*str && x < ili9341->width) {
        ILI9341_WriteCharScaled(ili9341, x, y, *str, font, color, bgColor, scale);
        x += font.width * scale + tracking;
        str++;
    }

    ILI9341_Deselect(ili9341);
}

/**
 * @brief Write a character with transparent background at specified coordinates without selecting/deselecting the
 * display
 * @param ili9341 Pointer to ILI9341 handle structure
 * @param x X coordinate of the top-left of the character
 * @param y Y coordinate of the top-left of the character
 * @param ch ASCII character to write
 * @param font Font definition to use for rendering the character
 * @param color 16-bit character color in RGB565 format
 */
static void ILI9341_WriteCharTransparent(
    ILI9341_HandleTypeDef* ili9341,
    int16_t x,
    int16_t y,
    char ch,
    ILI9341_FontDef font,
    uint16_t color
) {
    if (ch < 32 || ch > 126) ch = 32;

    uint16_t index = (ch - 32) * font.intsPerGlyph;
    uint32_t mask = 0x80000000;

    for (uint16_t row = 0; row < font.height; row++) {
        for (uint16_t col = 0; col < font.width; col++) {
            if (font.data[index] & mask) { ILI9341_DrawPixelFast(ili9341, x + col, y + row, color); }
            mask >>= 1;
            if (mask == 0) {
                index++;
                mask = 0x80000000;
            }
        }
    }
}

void ILI9341_WriteStringTransparent(
    ILI9341_HandleTypeDef* ili9341,
    int16_t x,
    int16_t y,
    const char* str,
    ILI9341_FontDef font,
    uint16_t color,
    int16_t tracking
) {
    if (y >= ili9341->height) return;

    ILI9341_Select(ili9341);

    while (*str && x < ili9341->width) {
        ILI9341_WriteCharTransparent(ili9341, x, y, *str, font, color);
        x += font.width + tracking;
        str++;
    }

    ILI9341_Deselect(ili9341);
}

/**
 * @brief Write a scaled character with transparent background at specified coordinates without selecting/deselecting
 * the display
 * @param ili9341 Pointer to ILI9341 handle structure
 * @param x X coordinate of the top-left of the character
 * @param y Y coordinate of the top-left of the character
 * @param ch ASCII character to write
 * @param font Font definition to use for rendering the character
 * @param color 16-bit character color in RGB565 format
 * @param scale Scaling factor (integer) to enlarge the character
 */
static void ILI9341_WriteCharTransparentScaled(
    ILI9341_HandleTypeDef* ili9341,
    int16_t x,
    int16_t y,
    char ch,
    ILI9341_FontDef font,
    uint16_t color,
    uint16_t scale
) {
    if (ch < 32 || ch > 126) ch = 32;

    uint16_t index = (ch - 32) * font.intsPerGlyph;
    uint32_t mask = 0x80000000;

    for (uint16_t row = 0; row < font.height; row++) {
        for (uint16_t col = 0; col < font.width; col++) {
            if (font.data[index] & mask) {
                ILI9341_FillRectangleFast(ili9341, x + col * scale, y + row * scale, scale, scale, color);
            }
            mask >>= 1;
            if (mask == 0) {
                index++;
                mask = 0x80000000;
            }
        }
    }
}

void ILI9341_WriteStringTransparentScaled(
    ILI9341_HandleTypeDef* ili9341,
    int16_t x,
    int16_t y,
    const char* str,
    ILI9341_FontDef font,
    uint16_t color,
    uint16_t scale,
    int16_t tracking
) {
    if (y >= ili9341->height) return;

    ILI9341_Select(ili9341);

    while (*str && x < ili9341->width) {
        ILI9341_WriteCharTransparentScaled(ili9341, x, y, *str, font, color, scale);
        x += font.width * scale + tracking;
        str++;
    }

    ILI9341_Deselect(ili9341);
}

void ILI9341_DrawImage(
    ILI9341_HandleTypeDef* ili9341,
    uint16_t x,
    uint16_t y,
    uint16_t w,
    uint16_t h,
    const uint16_t* data
) {
    if (x >= ili9341->width || y >= ili9341->height || (x + w - 1) >= ili9341->width || (y + h - 1) >= ili9341->height)
        return;

    ILI9341_Select(ili9341);
    ILI9341_SetAddressWindow(ili9341, x, y, x + w - 1, y + h - 1);
    ILI9341_WriteData(ili9341, (uint8_t*)data, sizeof(uint16_t) * w * h);
    ILI9341_Deselect(ili9341);
}

void ILI9341_InvertColors(ILI9341_HandleTypeDef* ili9341, bool invert) {
    ILI9341_Select(ili9341);
    ILI9341_WriteCommand(ili9341, invert ? 0x21 /* INVON */ : 0x20 /* INVOFF */);
    ILI9341_Deselect(ili9341);
}

/**
 * @brief Draw a line using Bresenham's algorithm without selecting/deselecting the display
 * @param ili9341 Pointer to ILI9341 handle structure
 * @param x1 X coordinate of the start point
 * @param y1 Y coordinate of the start point
 * @param x2 X coordinate of the end point
 * @param y2 Y coordinate of the end point
 * @param color 16-bit line color in RGB565 format
 */
static void ILI9341_DrawLineFast(
    ILI9341_HandleTypeDef* ili9341,
    int16_t x1,
    int16_t y1,
    int16_t x2,
    int16_t y2,
    uint16_t color
) {
    if (x1 == x2) {
        ILI9341_FillRectangleFast(ili9341, x1, y1, 1, y2 - y1 + 1, color);
        return;
    } else if (y1 == y2) {
        ILI9341_FillRectangleFast(ili9341, x1, y1, x2 - x1 + 1, 1, color);
        return;
    }

    int16_t dx = abs(x2 - x1), sx = x1 < x2 ? 1 : -1;
    int16_t dy = -abs(y2 - y1), sy = y1 < y2 ? 1 : -1;
    int16_t err = dx + dy, e2; /* error value e_xy */

    while (true) {
        ILI9341_DrawPixelFast(ili9341, x1, y1, color);
        if (x1 == x2 && y1 == y2) break;
        e2 = 2 * err;
        if (e2 >= dy) { /* e_xy+e_x > 0 */
            err += dy;
            x1 += sx;
        }
        if (e2 <= dx) { /* e_xy+e_y < 0 */
            err += dx;
            y1 += sy;
        }
    }
}

void ILI9341_DrawLine(ILI9341_HandleTypeDef* ili9341, int16_t x1, int16_t y1, int16_t x2, int16_t y2, uint16_t color) {
    ILI9341_Select(ili9341);
    ILI9341_DrawLineFast(ili9341, x1, y1, x2, y2, color);
    ILI9341_Deselect(ili9341);
}

