Nat-thapas/STM32-ILI9341/Src/ili9341.c
void ILI9341_DrawLineThick(
    ILI9341_HandleTypeDef* ili9341,
    int16_t x1,
    int16_t y1,
    int16_t x2,
    int16_t y2,
    uint16_t color,
    uint16_t thickness,
    bool cap
) {
    if (thickness == 0) return;
    if (thickness == 1) {
        ILI9341_DrawLine(ili9341, x1, y1, x2, y2, color);
        return;
    }

    // calculate line vector
    int16_t dx = x2 - x1;
    int16_t dy = y2 - y1;
    float length = sqrtf(dx * dx + dy * dy);
    if (length == 0) return;  // zero-length line

    // unit vector
    float ux = dx / length;
    float uy = dy / length;

    // perpendicular vector
    float px = -uy;
    float py = ux;

    // half thickness
    float halfThickness = thickness / 2.0f;

    // calculate corner points
    int16_t xCorners[4] = {
        (int16_t)(x1 + px * halfThickness),
        (int16_t)(x1 - px * halfThickness),
        (int16_t)(x2 - px * halfThickness),
        (int16_t)(x2 + px * halfThickness)
    };
    int16_t yCorners[4] = {
        (int16_t)(y1 + py * halfThickness),
        (int16_t)(y1 - py * halfThickness),
        (int16_t)(y2 - py * halfThickness),
        (int16_t)(y2 + py * halfThickness)
    };

    ILI9341_FillPolygon(ili9341, xCorners, yCorners, 4, color);

    if (cap) {
        ILI9341_FillCircle(ili9341, x1, y1, halfThickness, color);
        ILI9341_FillCircle(ili9341, x2, y2, halfThickness, color);
    }
}

void ILI9341_DrawRectangle(ILI9341_HandleTypeDef* ili9341, int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color) {
    ILI9341_DrawRectangleThick(ili9341, x, y, w, h, color, 1);
}

void ILI9341_DrawRectangleThick(
    ILI9341_HandleTypeDef* ili9341,
    int16_t x,
    int16_t y,
    int16_t w,
    int16_t h,
    uint16_t color,
    uint16_t thickness
) {
    if (thickness == 0) return;

    ILI9341_Select(ili9341);

    ILI9341_FillRectangleFast(ili9341, x, y, w, thickness, color);                              // top
    ILI9341_FillRectangleFast(ili9341, x, y + h - thickness, w, thickness, color);              // bottom
    ILI9341_FillRectangleFast(ili9341, x, y + thickness, thickness, h - 2 * thickness, color);  // left
    ILI9341_FillRectangleFast(ili9341, x + w - thickness, y + thickness, thickness, h - 2 * thickness, color);  // right

    ILI9341_Deselect(ili9341);
}

void ILI9341_DrawCircle(ILI9341_HandleTypeDef* ili9341, int16_t xc, int16_t yc, uint16_t r, uint16_t color) {
    int16_t f = 1 - r;
    int16_t ddF_x = 1;
    int16_t ddF_y = -2 * r;
    int16_t x = 0;
    int16_t y = r;

    ILI9341_Select(ili9341);

    ILI9341_DrawPixelFast(ili9341, xc, yc + r, color);
    ILI9341_DrawPixelFast(ili9341, xc, yc - r, color);
    ILI9341_DrawPixelFast(ili9341, xc + r, yc, color);
    ILI9341_DrawPixelFast(ili9341, xc - r, yc, color);

    while (x < y) {
        if (f >= 0) {
            y--;
            ddF_y += 2;
            f += ddF_y;
        }
        x++;
        ddF_x += 2;
        f += ddF_x;

        ILI9341_DrawPixelFast(ili9341, xc + x, yc + y, color);
        ILI9341_DrawPixelFast(ili9341, xc - x, yc + y, color);
        ILI9341_DrawPixelFast(ili9341, xc + x, yc - y, color);
        ILI9341_DrawPixelFast(ili9341, xc - x, yc - y, color);
        ILI9341_DrawPixelFast(ili9341, xc + y, yc + x, color);
        ILI9341_DrawPixelFast(ili9341, xc - y, yc + x, color);
        ILI9341_DrawPixelFast(ili9341, xc + y, yc - x, color);
        ILI9341_DrawPixelFast(ili9341, xc - y, yc - x, color);
    }

    ILI9341_Deselect(ili9341);
}

void ILI9341_DrawCircleThick(
    ILI9341_HandleTypeDef* ili9341,
    int16_t xc,
    int16_t yc,
    uint16_t r,
    uint16_t color,
    uint16_t thickness
) {
    if (thickness == 0) return;
    if (thickness > r) thickness = r;
    if (thickness == 1) {
        ILI9341_DrawCircle(ili9341, xc, yc, r, color);
        return;
    }

    uint16_t ri = r - thickness;
    uint16_t xo = r;
    uint16_t xi = ri;

    ILI9341_Select(ili9341);

    for (int16_t y = 0; y <= r; y++) {
        while (xo * xo + y * y > r * r) { xo--; }
        while (xi * xi + y * y > ri * ri) { xi--; }

        ILI9341_DrawLineFast(ili9341, xc - xo, yc + y, xc - xi, yc + y, color);
        ILI9341_DrawLineFast(ili9341, xc + xi, yc + y, xc + xo, yc + y, color);
        ILI9341_DrawLineFast(ili9341, xc - xo, yc - y, xc - xi, yc - y, color);
        ILI9341_DrawLineFast(ili9341, xc + xi, yc - y, xc + xo, yc - y, color);
    }

    ILI9341_Deselect(ili9341);
}

void ILI9341_FillCircle(ILI9341_HandleTypeDef* ili9341, int16_t xc, int16_t yc, uint16_t r, uint16_t color) {
    uint16_t x = r;

    ILI9341_Select(ili9341);

    for (uint16_t y = 0; y <= r; y++) {
        while (x * x + y * y > r * r) { x--; }
        ILI9341_DrawLineFast(ili9341, xc - x, yc + y, xc + x, yc + y, color);
        ILI9341_DrawLineFast(ili9341, xc - x, yc - y, xc + x, yc - y, color);
    }

    ILI9341_Deselect(ili9341);
}

void ILI9341_DrawPolygon(ILI9341_HandleTypeDef* ili9341, int16_t* x, int16_t* y, uint16_t n, uint16_t color) {
    if (n < 2) return;

    ILI9341_Select(ili9341);

    for (uint16_t i = 0; i < n - 1; i++) { ILI9341_DrawLineFast(ili9341, x[i], y[i], x[i + 1], y[i + 1], color); }
    ILI9341_DrawLineFast(ili9341, x[n - 1], y[n - 1], x[0], y[0], color);

    ILI9341_Deselect(ili9341);
}

void ILI9341_DrawPolygonThick(
    ILI9341_HandleTypeDef* ili9341,
    int16_t* x,
    int16_t* y,
    uint16_t n,
    uint16_t color,
    uint16_t thickness,
    bool cap
) {
    if (n < 2 || thickness == 0) return;
    if (thickness == 1) {
        ILI9341_DrawPolygon(ili9341, x, y, n, color);
        return;
    }

    for (uint16_t i = 0; i < n - 1; i++) {
        ILI9341_DrawLineThick(ili9341, x[i], y[i], x[i + 1], y[i + 1], color, thickness, cap);
    }
    ILI9341_DrawLineThick(ili9341, x[n - 1], y[n - 1], x[0], y[0], color, thickness, cap);
}

void ILI9341_FillPolygon(ILI9341_HandleTypeDef* ili9341, int16_t* x, int16_t* y, uint16_t n, uint16_t color) {
    if (n < 3) return;

    // find max and min Y
    int16_t minY = y[0], maxY = y[0];
    for (uint16_t i = 1; i < n; i++) {
        if (y[i] < minY) minY = y[i];
        if (y[i] > maxY) maxY = y[i];
    }

    if (minY >= ili9341->height) return;
    if (maxY < 0) return;
    if (minY < 0) minY = 0;
    if (maxY >= ili9341->height) maxY = ili9341->height - 1;

    int16_t nodeX[32];  // max 32 intersections

    ILI9341_Select(ili9341);

    // scanline algorithm
    for (uint16_t j = minY; j <= maxY; j++) {
        uint16_t nodes = 0;
        uint16_t k = n - 1;

        // find intersections
        for (uint16_t i = 0; i < n; i++) {
            if ((y[i] < j && y[k] >= j) || (y[k] < j && y[i] >= j)) {
                int16_t dy = y[k] - y[i];
                if (dy != 0 && nodes < 32) {
                    nodeX[nodes++] = x[i] + ((int32_t)(j - y[i]) * (int32_t)(x[k] - x[i])) / dy;
                }
            }
            k = i;
        }

        // insertion sort nodeX array
        for (uint16_t i = 1; i < nodes; i++) {
            int16_t key = nodeX[i];
            int16_t jSort = i - 1;
            while (jSort >= 0 && nodeX[jSort] > key) {
                nodeX[jSort + 1] = nodeX[jSort];
                jSort--;
            }
            nodeX[jSort + 1] = key;
        }

        // fill the pixels between node pairs
        for (uint16_t i = 0; i < nodes - 1; i += 2) {
            int16_t x1 = nodeX[i];
            int16_t x2 = nodeX[i + 1];

            if (x1 >= ili9341->width) break;
            if (x2 >= ili9341->width) x2 = ili9341->width - 1;
            if (x1 < ili9341->width && x2 > 0 && x2 >= x1) {
                ILI9341_FillRectangleFast(ili9341, x1, j, x2 - x1 + 1, 1, color);
            }
        }
    }

    ILI9341_Deselect(ili9341);
}
